stardio/STM32_Ethercat_AGV/Appli/Core/Src/soem_port.c
#include "soem_port.h"

#ifdef SOEM_ENABLED

#include "soem/ec_main.h"
#include "soem/ec_type.h"
#include "stm32h7rsxx.h"  /* For SCB_CleanDCache_by_Addr, __DSB, __ISB */
#include <limits.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#ifndef SOEM_IFNAME
#define SOEM_IFNAME "st_eth"
#endif

#ifndef SOEM_ENABLE_PERIODIC_PDO_DEBUG
#define SOEM_ENABLE_PERIODIC_PDO_DEBUG 0
#endif

#ifndef SOEM_ENABLE_CMD_DEBUG_LOG
#define SOEM_ENABLE_CMD_DEBUG_LOG 0
#endif

#ifndef SOEM_TARGET_REACHED_TOLERANCE_HW
#define SOEM_TARGET_REACHED_TOLERANCE_HW 5
#endif

#ifndef SOEM_POSITION_GAIN1_INDEX
#define SOEM_POSITION_GAIN1_INDEX 0x2101U
#endif

#ifndef SOEM_POSITION_GAIN2_INDEX
#define SOEM_POSITION_GAIN2_INDEX 0x2105U
#endif

#ifndef SOEM_POSITION_GAIN_SUBINDEX
#define SOEM_POSITION_GAIN_SUBINDEX 0U
#endif

#ifndef SOEM_ACCDEC_MAX_MS
#define SOEM_ACCDEC_MAX_MS 10000U
#endif

#ifndef SOEM_SW_LIMIT_ABS_MAX_UU
#define SOEM_SW_LIMIT_ABS_MAX_UU 1073741823L
#endif

/* Forward declaration */
static void soem_log(const char *msg);
static int32_t soem_clamp_hw_position(int32_t hwPos);

ecx_contextt soem_context;
/* Keep IOmap in AXI SRAM non-cacheable region (RAM_CMD) for ETH DMA coherency.
 * ETH DMA uses AXI bus — cannot access SRAMAHB (AHB-only). */
static uint8 soem_iomap[4096] __attribute__((section(".eth_dma"), aligned(32)));
static uint8 soem_group = 0;
static uint8 soem_initialized = 0;
static uint8 soem_configured = 0;
static uint8 soem_pdo_ready = 0;
static void (*soem_log_fn)(const char *msg) = NULL;

typedef struct __attribute__((packed))
{
  uint16 controlword;
  int32 target_position;
} soem_rxpdo_t;

typedef struct __attribute__((packed))
{
  uint16 statusword;
  int32 position_actual;
  int32 velocity_actual;
  int16 torque_actual;
} soem_txpdo_t;

static soem_rxpdo_t *soem_rxpdo = NULL;
static soem_txpdo_t *soem_txpdo = NULL;
static uint16 soem_last_statusword = 0xFFFFU;
static uint16 soem_last_controlword = 0xFFFFU;
static int32 soem_target_position = 0;
static int32 soem_target_position_output = 0;
static uint8 soem_last_state = 0xFFU;

/* Volatile shadow copies for safe UI access (TouchGFX) */
static volatile int32_t  soem_shadow_position = 0;
static volatile int32_t  soem_shadow_velocity = 0;
static volatile int16_t  soem_shadow_torque   = 0;
static volatile uint16_t soem_shadow_statusword = 0;
static volatile uint8_t  soem_shadow_pdo_ready  = 0;
static volatile uint8_t  soem_shadow_run_enable = 0;
static volatile int32_t  soem_profile_velocity = 0;
static volatile uint16_t soem_torque_limit_percent = 0;
static volatile uint8_t  soem_profile_velocity_pending = 0U;
static volatile uint8_t  soem_torque_limit_pending = 0U;
static volatile int32_t  soem_profile_acceleration = 0;
static volatile int32_t  soem_profile_deceleration = 0;
static volatile uint8_t  soem_profile_acceleration_pending = 0U;
static volatile uint8_t  soem_profile_deceleration_pending = 0U;
static volatile int32_t  soem_limit_plus_user = INT32_MAX;
static volatile int32_t  soem_limit_minus_user = INT32_MIN;
static volatile int32_t  soem_limit_plus_hw = INT32_MAX;
static volatile int32_t  soem_limit_minus_hw = INT32_MIN;
static volatile uint8_t  soem_software_limits_pending = 0U;
static volatile uint8_t  soem_software_limits_enabled = 0U;
static volatile uint8_t  soem_software_limits_blocked = 0U;
static volatile int32_t  soem_unit_scale = 1;
static volatile uint8_t  soem_unit_scale_pending = 0U;
static volatile uint8_t  soem_home_offset_pending = 0U;
static volatile int32_t  soem_position_gain = 0;
static volatile uint8_t  soem_position_gain_pending = 0U;
static volatile uint8_t  soem_position_gain_read_pending = 0U;
static volatile uint8_t  soem_position_gain_read_updated = 0U;
static volatile int32_t  soem_position_gain_readback = 0;
static volatile int32_t  soem_position_gain_read_status = 0;
static volatile uint8_t  soem_parameter_read_all_pending = 0U;
static volatile uint8_t  soem_parameter_read_all_updated = 0U;
static volatile int32_t  soem_parameter_read_all_values[SOEM_PARAMETER_PAGE_VALUE_COUNT] = {0};

static int soem_try_write_position_gain(uint16 index, int32_t gain, uint8_t *used16bit)
{
  uint32 gain32 = (uint32)gain;
  int wkc = ecx_SDOwrite(&soem_context,
                         1,
                         index,
                         SOEM_POSITION_GAIN_SUBINDEX,
                         FALSE,
                         sizeof(gain32),
                         &gain32,
                         EC_TIMEOUTRXM);
  if (wkc > 0)
  {
    if (used16bit != NULL)
    {
      *used16bit = 0U;
    }
    return wkc;
  }

  uint16 gain16 = (gain > 65535) ? 65535U : (uint16)gain;
  wkc = ecx_SDOwrite(&soem_context,
                     1,
                     index,
                     SOEM_POSITION_GAIN_SUBINDEX,
                     FALSE,
                     sizeof(gain16),
                     &gain16,
                     EC_TIMEOUTRXM);
  if ((wkc > 0) && (used16bit != NULL))
  {
    *used16bit = 1U;
  }

  return wkc;
}

static int soem_try_read_position_gain(uint16 index, int32_t *gainOut, uint8_t *used16bit)
{
  if (gainOut == NULL)
  {
    return 0;
  }

  uint32 gain32 = 0U;
  int readSize = (int)sizeof(gain32);
  int wkc = ecx_SDOread(&soem_context,
                        1,
                        index,
                        SOEM_POSITION_GAIN_SUBINDEX,
                        FALSE,
                        &readSize,
                        &gain32,
                        EC_TIMEOUTRXM);
  if (wkc > 0)
  {
    if ((readSize > 0) && (readSize <= (int)sizeof(uint16)))
    {
      *gainOut = (int32_t)((uint16)gain32);
      if (used16bit != NULL)
      {
        *used16bit = 1U;
      }
    }
    else
    {
      *gainOut = (int32_t)gain32;
      if (used16bit != NULL)
      {
        *used16bit = 0U;
      }
    }
    return wkc;
  }

