stardio/STM32_Ethercat_AGV/Appli/Core/Src/soem_port.c
  uint16 gain16 = 0U;
  readSize = (int)sizeof(gain16);
  wkc = ecx_SDOread(&soem_context,
                    1,
                    index,
                    SOEM_POSITION_GAIN_SUBINDEX,
                    FALSE,
                    &readSize,
                    &gain16,
                    EC_TIMEOUTRXM);
  if (wkc > 0)
  {
    *gainOut = (int32_t)gain16;
    if (used16bit != NULL)
    {
      *used16bit = 1U;
    }
  }

  return wkc;
}

static int soem_read_int32_object(uint16 index, uint8 subindex, int32_t *valueOut)
{
  if (valueOut == NULL)
  {
    return 0;
  }

  int32_t value = 0;
  int readSize = (int)sizeof(value);
  int wkc = ecx_SDOread(&soem_context,
                        1,
                        index,
                        subindex,
                        FALSE,
                        &readSize,
                        &value,
                        EC_TIMEOUTRXM);
  if (wkc > 0)
  {
    *valueOut = value;
  }
  return wkc;
}

static int soem_read_uint32_object(uint16 index, uint8 subindex, uint32_t *valueOut)
{
  if (valueOut == NULL)
  {
    return 0;
  }

  uint32_t value = 0U;
  int readSize = (int)sizeof(value);
  int wkc = ecx_SDOread(&soem_context,
                        1,
                        index,
                        subindex,
                        FALSE,
                        &readSize,
                        &value,
                        EC_TIMEOUTRXM);
  if (wkc > 0)
  {
    *valueOut = value;
  }
  return wkc;
}

static int soem_write_uint16_object(uint16 index, uint8 subindex, uint16_t value)
{
  return ecx_SDOwrite(&soem_context,
                      1,
                      index,
                      subindex,
                      FALSE,
                      sizeof(value),
                      &value,
                      EC_TIMEOUTRXM);
}

static int soem_read_uint16_object(uint16 index, uint8 subindex, uint16_t *valueOut)
{
  if (valueOut == NULL)
  {
    return 0;
  }

  uint16_t value = 0U;
  int readSize = (int)sizeof(value);
  int wkc = ecx_SDOread(&soem_context,
                        1,
                        index,
                        subindex,
                        FALSE,
                        &readSize,
                        &value,
                        EC_TIMEOUTRXM);
  if (wkc > 0)
  {
    *valueOut = value;
  }
  return wkc;
}

/* Home offset: set by SOEM_SetHomePosition().
 * All position reads are relative to this origin.
 * All target writes are translated back to absolute hardware counts. */
static volatile int32_t  soem_home_offset = 0;

static void soem_latch_target_to_actual(const char *reason)
{
  soem_target_position = soem_clamp_hw_position((int32_t)soem_shadow_position);
  soem_target_position_output = soem_target_position;
  if ((reason != NULL) && (reason[0] != '\0'))
  {
    soem_log(reason);
  }
}

static void soem_log_fault_diagnostics(uint16 statusword)
{
  char line[96];
  uint16 faultCode = 0U;
  uint8 faultReg = 0U;
  int okCode = ecx_SDOread(&soem_context, 1, 0x603F, 0, FALSE, (int[]){ (int)sizeof(faultCode) }, &faultCode, EC_TIMEOUTRXM);
  int okReg = ecx_SDOread(&soem_context, 1, 0x1001, 0, FALSE, (int[]){ (int)sizeof(faultReg) }, &faultReg, EC_TIMEOUTRXM);

  if (okCode > 0)
  {
    (void)snprintf(line, sizeof(line), "CIA402: fault code=0x%04X status=0x%04X", faultCode, statusword);
    soem_log(line);
  }
  else
  {
    (void)snprintf(line, sizeof(line), "CIA402: fault code read failed status=0x%04X", statusword);
    soem_log(line);
  }

  if (okReg > 0)
  {
    (void)snprintf(line, sizeof(line), "CIA402: fault register=0x%02X", faultReg);
    soem_log(line);
  }

  (void)snprintf(line, sizeof(line), "CIA402: actual=%ld target=%ld hwLimits=[%ld,%ld]",
                 (long)soem_shadow_position,
                 (long)soem_target_position,
                 (long)soem_limit_minus_hw,
                 (long)soem_limit_plus_hw);
  soem_log(line);

  (void)snprintf(line, sizeof(line), "CIA402: userLimits=[%ld,%ld] unit=%ld home=%ld limits=%s",
                 (long)soem_limit_minus_user,
                 (long)soem_limit_plus_user,
                 (long)soem_unit_scale,
                 (long)soem_home_offset,
                 (soem_software_limits_enabled != 0U) ? "on" : "off");
  soem_log(line);
}

/* SOEM_PortPoll is called every ~100 ms in main task. */
#define SOEM_CIA402_HOLD_CYCLES 5U      /* ~500 ms */
#define SOEM_CIA402_TIMEOUT_CYCLES 50U  /* ~5 s */

typedef enum
{
  SOEM_CIA402_STAGE_SEND_SHUTDOWN = 0,
  SOEM_CIA402_STAGE_WAIT_READY,
  SOEM_CIA402_STAGE_SEND_SWITCH_ON,
  SOEM_CIA402_STAGE_WAIT_SWITCHED_ON,
  SOEM_CIA402_STAGE_SEND_ENABLE_OP,
  SOEM_CIA402_STAGE_WAIT_OPERATION_ENABLED,
  SOEM_CIA402_STAGE_OPERATION_ENABLED
} soem_cia402_stage_t;

static soem_cia402_stage_t soem_cia402_stage = SOEM_CIA402_STAGE_SEND_SHUTDOWN;
static uint16 soem_cia402_hold_counter = 0U;
static uint16 soem_cia402_timeout_counter = 0U;
static uint8 soem_fault_active = 0U;

/* Manual 1st PDO mapping: RxPDO=0x1600, TxPDO=0x1A00 */
#define SOEM_RXPDO_ASSIGN_INDEX 0x1600U
#define SOEM_TXPDO_ASSIGN_INDEX 0x1A00U
#define SOEM_DC_CYCLE_NS 100000000U /* 100 ms */
#define SOEM_DC_SHIFT_NS 0

static int soem_apply_manual_pdo_mapping(uint16 slave)
{
  int wkc;
  uint8 u8val;
  uint16 u16val;
  uint32 u32val;

  /* [Step 1] Clear SM2/SM3 assignment lists */
  u8val = 0;
  wkc = ecx_SDOwrite(&soem_context, slave, 0x1C12, 0, FALSE, sizeof(u8val), &u8val, EC_TIMEOUTRXM);
  if (wkc <= 0) { soem_log("PDO: SM2 clear fail"); return 0; }
  wkc = ecx_SDOwrite(&soem_context, slave, 0x1C13, 0, FALSE, sizeof(u8val), &u8val, EC_TIMEOUTRXM);
  if (wkc <= 0) { soem_log("PDO: SM3 clear fail"); return 0; }
  soem_log("PDO: SM assignment cleared");

  /* Small delay for slave internal processing */
  for (volatile int d = 0; d < 500000; d++) { }

  /* [Step 2] Configure RxPDO 0x1600: Controlword(16) + Target Position(32) = 6 bytes */
  u8val = 0;
  wkc = ecx_SDOwrite(&soem_context, slave, 0x1600, 0, FALSE, sizeof(u8val), &u8val, EC_TIMEOUTRXM);
  if (wkc <= 0) { soem_log("PDO: 0x1600 sub0 clear fail"); return 0; }
  u32val = 0x60400010U;  /* Controlword, 16-bit */
  wkc = ecx_SDOwrite(&soem_context, slave, 0x1600, 1, FALSE, sizeof(u32val), &u32val, EC_TIMEOUTRXM);
  if (wkc <= 0) { soem_log("PDO: 0x1600 sub1 fail"); return 0; }
  u32val = 0x607A0020U;  /* Target Position, 32-bit */
  wkc = ecx_SDOwrite(&soem_context, slave, 0x1600, 2, FALSE, sizeof(u32val), &u32val, EC_TIMEOUTRXM);
  if (wkc <= 0) { soem_log("PDO: 0x1600 sub2 fail"); return 0; }
  u8val = 2;
  wkc = ecx_SDOwrite(&soem_context, slave, 0x1600, 0, FALSE, sizeof(u8val), &u8val, EC_TIMEOUTRXM);
  if (wkc <= 0) { soem_log("PDO: 0x1600 sub0 set fail"); return 0; }
  soem_log("PDO: RxPDO 0x1600 configured (6 bytes)");

