stardio/STM32_Ethercat_AGV/Appli/Core/Src/soem_port.c
  /* [Step 3] Configure TxPDO 0x1A00: Statusword(16) + Position(32) + Velocity(32) + Torque(16) = 12 bytes */
  u8val = 0;
  wkc = ecx_SDOwrite(&soem_context, slave, 0x1A00, 0, FALSE, sizeof(u8val), &u8val, EC_TIMEOUTRXM);
  if (wkc <= 0) { soem_log("PDO: 0x1A00 sub0 clear fail"); return 0; }
  u32val = 0x60410010U;  /* Statusword, 16-bit */
  wkc = ecx_SDOwrite(&soem_context, slave, 0x1A00, 1, FALSE, sizeof(u32val), &u32val, EC_TIMEOUTRXM);
  if (wkc <= 0) { soem_log("PDO: 0x1A00 sub1 fail"); return 0; }
  u32val = 0x60640020U;  /* Actual Position, 32-bit */
  wkc = ecx_SDOwrite(&soem_context, slave, 0x1A00, 2, FALSE, sizeof(u32val), &u32val, EC_TIMEOUTRXM);
  if (wkc <= 0) { soem_log("PDO: 0x1A00 sub2 fail"); return 0; }
  u32val = 0x606C0020U;  /* Actual Velocity, 32-bit */
  wkc = ecx_SDOwrite(&soem_context, slave, 0x1A00, 3, FALSE, sizeof(u32val), &u32val, EC_TIMEOUTRXM);
  if (wkc <= 0) { soem_log("PDO: 0x1A00 sub3 fail"); return 0; }
  u32val = 0x60770010U;  /* Actual Torque, 16-bit */
  wkc = ecx_SDOwrite(&soem_context, slave, 0x1A00, 4, FALSE, sizeof(u32val), &u32val, EC_TIMEOUTRXM);
  if (wkc <= 0) { soem_log("PDO: 0x1A00 sub4 fail"); return 0; }
  u8val = 4;
  wkc = ecx_SDOwrite(&soem_context, slave, 0x1A00, 0, FALSE, sizeof(u8val), &u8val, EC_TIMEOUTRXM);
  if (wkc <= 0) { soem_log("PDO: 0x1A00 sub0 set fail"); return 0; }
  soem_log("PDO: TxPDO 0x1A00 configured (12 bytes)");

  /* [Step 4] Assign PDOs to SM2/SM3 */
  u16val = 0x1600U;
  wkc = ecx_SDOwrite(&soem_context, slave, 0x1C12, 1, FALSE, sizeof(u16val), &u16val, EC_TIMEOUTRXM);
  if (wkc <= 0) { soem_log("PDO: SM2 assign fail"); return 0; }
  u16val = 0x1A00U;
  wkc = ecx_SDOwrite(&soem_context, slave, 0x1C13, 1, FALSE, sizeof(u16val), &u16val, EC_TIMEOUTRXM);
  if (wkc <= 0) { soem_log("PDO: SM3 assign fail"); return 0; }

  /* Small delay before activation */
  for (volatile int d = 0; d < 500000; d++) { }

  /* [Step 5] Activate: set count = 1 */
  u8val = 1;
  wkc = ecx_SDOwrite(&soem_context, slave, 0x1C12, 0, FALSE, sizeof(u8val), &u8val, EC_TIMEOUTRXM);
  if (wkc <= 0) { soem_log("PDO: SM2 activate fail"); return 0; }
  wkc = ecx_SDOwrite(&soem_context, slave, 0x1C13, 0, FALSE, sizeof(u8val), &u8val, EC_TIMEOUTRXM);
  if (wkc <= 0) { soem_log("PDO: SM3 activate fail"); return 0; }

  soem_log("PDO: Manual mapping complete (Rx=6B, Tx=12B)");
  return 1;
}

static uint8 soem_decode_cia402_state(uint16 statusword)
{
  uint16 masked = (uint16)(statusword & 0x006FU);

  switch (masked)
  {
    case 0x0000U:
      return 0U; /* Not ready to switch on */
    case 0x0040U:
      return 1U; /* Switch on disabled */
    case 0x0021U:
      return 2U; /* Ready to switch on */
    case 0x0023U:
      return 3U; /* Switched on */
    case 0x0027U:
      return 4U; /* Operation enabled */
    case 0x0007U:
      return 5U; /* Quick stop active */
    case 0x000FU:
      return 6U; /* Fault reaction active */
    case 0x0008U:
      return 7U; /* Fault */
    default:
      return 255U; /* Unknown */
  }
}

static void soem_log(const char *msg)
{
  if (soem_log_fn != NULL)
  {
    size_t n = strlen(msg);
    if ((n > 0U) && ((msg[n - 1U] == '\n') || (msg[n - 1U] == '\r')))
    {
      soem_log_fn(msg);
    }
    else
    {
      char line[192];
      (void)snprintf(line, sizeof(line), "%s\r\n", msg);
      soem_log_fn(line);
    }
  }
}

static void soem_log_cia402_state(uint8 state)
{
  switch (state)
  {
    case 0U:
      soem_log("CIA402: Not ready to switch on");
      break;
    case 1U:
      soem_log("CIA402: Switch on disabled");
      break;
    case 2U:
      soem_log("CIA402: Ready to switch on");
      break;
    case 3U:
      soem_log("CIA402: Switched on");
      break;
    case 4U:
      soem_log("CIA402: Operation enabled");
      break;
    case 5U:
      soem_log("CIA402: Quick stop active");
      break;
    case 6U:
      soem_log("CIA402: Fault reaction active");
      break;
    case 7U:
      soem_log("CIA402: Fault");
      break;
    default:
      soem_log("CIA402: Unknown state");
      break;
  }
}

static int32_t soem_saturated_user_to_hw(int32_t userPos)
{
  int32_t scale = (soem_unit_scale > 0) ? soem_unit_scale : 1;
  int64_t hw = (int64_t)userPos * (int64_t)scale + (int64_t)soem_home_offset;
  if (hw > (int64_t)INT32_MAX)
  {
    hw = (int64_t)INT32_MAX;
  }
  else if (hw < (int64_t)INT32_MIN)
  {
    hw = (int64_t)INT32_MIN;
  }
  return (int32_t)hw;
}

static int32_t soem_hw_to_user(int32_t hwPos)
{
  int32_t scale = (soem_unit_scale > 0) ? soem_unit_scale : 1;
  int64_t user = ((int64_t)hwPos - (int64_t)soem_home_offset) / (int64_t)scale;
  if (user > (int64_t)INT32_MAX)
  {
    user = (int64_t)INT32_MAX;
  }
  else if (user < (int64_t)INT32_MIN)
  {
    user = (int64_t)INT32_MIN;
  }
  return (int32_t)user;
}

static int32_t soem_clamp_user_position(int32_t userPos)
{
  if (soem_software_limits_enabled == 0U)
  {
    return userPos;
  }

  if (userPos > soem_limit_plus_user)
  {
    return soem_limit_plus_user;
  }
  if (userPos < soem_limit_minus_user)
  {
    return soem_limit_minus_user;
  }
  return userPos;
}

static int32_t soem_clamp_hw_position(int32_t hwPos)
{
  if (soem_software_limits_enabled == 0U)
  {
    return hwPos;
  }

  if (hwPos > soem_limit_plus_hw)
  {
    return soem_limit_plus_hw;
  }
  if (hwPos < soem_limit_minus_hw)
  {
    return soem_limit_minus_hw;
  }
  return hwPos;
}

static int32_t soem_get_target_step_hw_per_cycle(void)
{
  int64_t velocityUser = (int64_t)((soem_profile_velocity < 0) ? -soem_profile_velocity : soem_profile_velocity);
  int64_t scale = (int64_t)((soem_unit_scale > 0) ? soem_unit_scale : 1);
  int64_t velocityHwPerSec = velocityUser * scale;
  int64_t stepHwPerCycle = velocityHwPerSec / 1000LL; /* 1 ms cycle */

  if (stepHwPerCycle < 1LL)
  {
    stepHwPerCycle = 1LL;
  }
  else if (stepHwPerCycle > (int64_t)INT32_MAX)
  {
    stepHwPerCycle = (int64_t)INT32_MAX;
  }

  return (int32_t)stepHwPerCycle;
}

