stardio/STM32_Ethercat_AGV/Appli/Core/Src/soem_port.c
static void soem_update_target_position_output(void)
{
  int32_t command = soem_target_position;
  int32_t output = soem_target_position_output;

  int64_t errorToActual = (int64_t)command - (int64_t)soem_shadow_position;
  if (errorToActual < 0)
  {
    errorToActual = -errorToActual;
  }

  if (errorToActual <= (int64_t)SOEM_TARGET_REACHED_TOLERANCE_HW)
  {
    /* Keep commanded target fixed to avoid cumulative drift across cycles.
     * Only settle output to the command when we are inside tolerance. */
    soem_target_position_output = soem_clamp_hw_position(command);
    return;
  }

  if (output == command)
  {
    return;
  }

  const int32_t step = soem_get_target_step_hw_per_cycle();
  const int64_t diff = (int64_t)command - (int64_t)output;

  if (diff > (int64_t)step)
  {
    output += step;
  }
  else if (diff < -(int64_t)step)
  {
    output -= step;
  }
  else
  {
    output = command;
  }

  soem_target_position_output = soem_clamp_hw_position(output);
}

static void soem_refresh_hw_limits(void)
{
  /* Treat zero-width or inverted ranges as disabled.
   * This avoids immediate servo faults when uninitialized UI parameters save
   * Limit+ = 0 and Limit- = 0, which would otherwise force the allowed range
   * to a single point at the origin. */
  if ((soem_limit_plus_user <= soem_limit_minus_user) ||
      ((soem_limit_plus_user == 0) && (soem_limit_minus_user == 0)))
  {
    soem_limit_plus_hw = INT32_MAX;
    soem_limit_minus_hw = INT32_MIN;
    soem_software_limits_enabled = 0U;
    soem_software_limits_blocked = 0U;
  }
  else
  {
    soem_software_limits_enabled = 1U;
    soem_software_limits_blocked = 0U;
    if (soem_limit_plus_user >= (INT32_MAX / 2))
    {
      soem_limit_plus_hw = INT32_MAX;
    }
    else
    {
      soem_limit_plus_hw = soem_saturated_user_to_hw(soem_limit_plus_user);
    }

    if (soem_limit_minus_user <= (INT32_MIN / 2))
    {
      soem_limit_minus_hw = INT32_MIN;
    }
    else
    {
      soem_limit_minus_hw = soem_saturated_user_to_hw(soem_limit_minus_user);
    }
  }

  if (soem_limit_minus_hw > soem_limit_plus_hw)
  {
    int32_t tmp = soem_limit_minus_hw;
    soem_limit_minus_hw = soem_limit_plus_hw;
    soem_limit_plus_hw = tmp;
  }

  if (soem_software_limits_enabled != 0U)
  {
    const int32_t actualHw = (int32_t)soem_shadow_position;
    const int32_t targetHw = soem_target_position;

    if ((actualHw < soem_limit_minus_hw) || (actualHw > soem_limit_plus_hw) ||
        (targetHw < soem_limit_minus_hw) || (targetHw > soem_limit_plus_hw))
    {
      soem_limit_plus_hw = INT32_MAX;
      soem_limit_minus_hw = INT32_MIN;
      soem_software_limits_enabled = 0U;
      soem_software_limits_blocked = 1U;
    }
  }

  soem_target_position = soem_clamp_hw_position(soem_target_position);
  soem_target_position_output = soem_clamp_hw_position(soem_target_position_output);
}

static uint8_t soem_allow_parameter_sdo_writes(void)
{
  int32_t velocityAbs = soem_shadow_velocity;
  int64_t positionError = (int64_t)soem_target_position_output - (int64_t)soem_shadow_position;

  if (soem_cia402_stage != SOEM_CIA402_STAGE_OPERATION_ENABLED)
  {
    return 1U;
  }

  if (velocityAbs < 0)
  {
    velocityAbs = -velocityAbs;
  }
  if (positionError < 0)
  {
    positionError = -positionError;
  }

  return ((velocityAbs <= 1) &&
          (positionError <= (int64_t)SOEM_TARGET_REACHED_TOLERANCE_HW)) ? 1U : 0U;
}

static void soem_apply_pending_motion_settings(void)
{
  if ((soem_profile_velocity_pending == 0U) &&
      (soem_torque_limit_pending == 0U) &&
      (soem_profile_acceleration_pending == 0U) &&
      (soem_profile_deceleration_pending == 0U) &&
      (soem_software_limits_pending == 0U) &&
      (soem_unit_scale_pending == 0U) &&
      (soem_home_offset_pending == 0U) &&
      (soem_position_gain_pending == 0U) &&
      (soem_parameter_read_all_pending == 0U) &&
      (soem_position_gain_read_pending == 0U))
  {
    return;
  }

  if (soem_context.slavecount < 1)
  {
    if (soem_position_gain_read_pending != 0U)
    {
      soem_position_gain_read_pending = 0U;
      soem_position_gain_read_status = -20;
      soem_log("SOEM: position gain read failed (no slave)");
    }
    if (soem_parameter_read_all_pending != 0U)
    {
      soem_parameter_read_all_pending = 0U;
      soem_log("SOEM: parameter read-all failed (no slave)");
    }
    return;
  }

  const uint8 allowSdoWrites = soem_allow_parameter_sdo_writes();

  if ((allowSdoWrites != 0U) && (soem_profile_velocity_pending != 0U))
  {
    uint32 velocity = (uint32)soem_profile_velocity;
    int wkc = ecx_SDOwrite(&soem_context, 1, 0x6081, 0, FALSE, sizeof(velocity), &velocity, EC_TIMEOUTRXM);
    if (wkc > 0)
    {
      soem_profile_velocity_pending = 0U;
      soem_log("SOEM: profile velocity applied");
    }
    else
    {
      soem_profile_velocity_pending = 0U;
      soem_log("SOEM: profile velocity apply failed");
    }
  }

  if ((allowSdoWrites != 0U) && (soem_torque_limit_pending != 0U))
  {
    /* 0x6072 is per-mille (1000 = 100.0%). */
    uint16 torquePermille = (uint16)(soem_torque_limit_percent * 10U);
    int wkc = ecx_SDOwrite(&soem_context, 1, 0x6072, 0, FALSE, sizeof(torquePermille), &torquePermille, EC_TIMEOUTRXM);
    if (wkc > 0)
    {
      soem_torque_limit_pending = 0U;
      soem_log("SOEM: torque limit applied");
    }
    else
    {
      soem_torque_limit_pending = 0U;
      soem_log("SOEM: torque limit apply failed");
    }
  }

  if ((allowSdoWrites != 0U) && (soem_profile_acceleration_pending != 0U))
  {
    uint16_t acceleration = (uint16_t)soem_profile_acceleration;
    uint16_t accelerationRead = 0U;
    int wkc = soem_write_uint16_object(0x2301, 0, acceleration);
    if ((wkc > 0) && (soem_read_uint16_object(0x2301, 0, &accelerationRead) > 0))
    {
      soem_profile_acceleration = (int32_t)accelerationRead;
      soem_profile_acceleration_pending = 0U;
      if (accelerationRead != acceleration)
      {
        char line[120];
        (void)snprintf(line,
                       sizeof(line),
                       "SOEM: profile acceleration adjusted req=%lu act=%lu",
                       (unsigned long)acceleration,
                       (unsigned long)accelerationRead);
        soem_log(line);
      }
      else
      {
        soem_log("SOEM: profile acceleration applied (u16)");
      }
    }
    else
    {
      soem_profile_acceleration_pending = 0U;
      soem_log("SOEM: profile acceleration apply failed");
    }
  }

  if ((allowSdoWrites != 0U) && (soem_profile_deceleration_pending != 0U))
  {
    uint16_t deceleration = (uint16_t)soem_profile_deceleration;
    uint16_t decelerationRead = 0U;
    int wkc = soem_write_uint16_object(0x2302, 0, deceleration);
    if ((wkc > 0) && (soem_read_uint16_object(0x2302, 0, &decelerationRead) > 0))
    {
      soem_profile_deceleration = (int32_t)decelerationRead;
      soem_profile_deceleration_pending = 0U;
      if (decelerationRead != deceleration)
      {
        char line[120];
        (void)snprintf(line,
                       sizeof(line),
                       "SOEM: profile deceleration adjusted req=%lu act=%lu",
                       (unsigned long)deceleration,
                       (unsigned long)decelerationRead);
        soem_log(line);
      }
      else
      {
        soem_log("SOEM: profile deceleration applied (u16)");
      }
    }
    else
    {
      soem_profile_deceleration_pending = 0U;
      soem_log("SOEM: profile deceleration apply failed");
    }
  }

  if ((allowSdoWrites != 0U) && (soem_software_limits_pending != 0U))
  {
    if ((soem_limit_plus_user <= soem_limit_minus_user) ||
        ((soem_limit_plus_user == 0) && (soem_limit_minus_user == 0)))
    {
      soem_software_limits_pending = 0U;
      soem_log("SOEM: software limits invalid (0x607D write skipped)");
    }
    else
    {
      int32_t minLimit = soem_limit_minus_user;
      int32_t maxLimit = soem_limit_plus_user;
      int wkcMax = ecx_SDOwrite(&soem_context, 1, 0x607D, 2, FALSE, sizeof(maxLimit), &maxLimit, EC_TIMEOUTRXM);
      int wkcMin = ecx_SDOwrite(&soem_context, 1, 0x607D, 1, FALSE, sizeof(minLimit), &minLimit, EC_TIMEOUTRXM);
      int32_t minRead = 0;
      int32_t maxRead = 0;
      int okMinRead = soem_read_int32_object(0x607D, 1, &minRead);
      int okMaxRead = soem_read_int32_object(0x607D, 2, &maxRead);
      if ((wkcMin > 0) && (wkcMax > 0) && (okMinRead > 0) && (okMaxRead > 0))
      {
        soem_software_limits_pending = 0U;
        if ((minRead != minLimit) || (maxRead != maxLimit))
        {
          char line[144];
          (void)snprintf(line,
                         sizeof(line),
                         "SOEM: software limits adjusted req=[%ld,%ld] act=[%ld,%ld]",
                         (long)minLimit,
                         (long)maxLimit,
                         (long)minRead,
                         (long)maxRead);
          soem_log(line);
        }
        else
        {
          soem_log("SOEM: software limits applied");
        }
      }
      else
      {
        soem_software_limits_pending = 0U;
        soem_log("SOEM: software limits apply failed");
      }
    }
  }

