stardio/STM32_Ethercat_AGV/Appli/Core/Src/soem_port.c
  if ((allowSdoWrites != 0U) && (soem_unit_scale_pending != 0U))
  {
    uint32 feedConst = (uint32)((soem_unit_scale > 0) ? soem_unit_scale : 1);
    uint32 shaftRevs = 1U;
    int wkcFeed = ecx_SDOwrite(&soem_context, 1, 0x6092, 1, FALSE, sizeof(feedConst), &feedConst, EC_TIMEOUTRXM);
    int wkcRevs = ecx_SDOwrite(&soem_context, 1, 0x6092, 2, FALSE, sizeof(shaftRevs), &shaftRevs, EC_TIMEOUTRXM);
    if ((wkcFeed > 0) && (wkcRevs > 0))
    {
      soem_unit_scale_pending = 0U;
      soem_log("SOEM: unit scale applied");
    }
    else
    {
      soem_unit_scale_pending = 0U;
      soem_log("SOEM: unit scale apply failed");
    }
  }

  if ((allowSdoWrites != 0U) && (soem_home_offset_pending != 0U))
  {
    int32_t homeOffset = soem_home_offset;
    int wkc = ecx_SDOwrite(&soem_context, 1, 0x607C, 0, FALSE, sizeof(homeOffset), &homeOffset, EC_TIMEOUTRXM);
    if (wkc > 0)
    {
      soem_home_offset_pending = 0U;
      soem_log("SOEM: home offset applied");
    }
    else
    {
      soem_home_offset_pending = 0U;
      soem_log("SOEM: home offset apply failed");
    }
  }

  if ((allowSdoWrites != 0U) && (soem_position_gain_pending != 0U))
  {
    uint8_t used16_1 = 0U;
    uint8_t used16_2 = 0U;
    int wkc1 = soem_try_write_position_gain(SOEM_POSITION_GAIN1_INDEX, soem_position_gain, &used16_1);
    int wkc2 = soem_try_write_position_gain(SOEM_POSITION_GAIN2_INDEX, soem_position_gain, &used16_2);
    soem_position_gain_pending = 0U;

    if ((wkc1 > 0) || (wkc2 > 0))
    {
      char line[128];
      (void)snprintf(line,
                     sizeof(line),
                     "SOEM: position gain applied [2101:%s 2105:%s]",
                     (wkc1 > 0) ? (used16_1 ? "ok16" : "ok32") : "fail",
                     (wkc2 > 0) ? (used16_2 ? "ok16" : "ok32") : "fail");
      soem_log(line);
    }
    else
    {
      int32_t abortCode = 0;
      ec_errort err;
      uint8_t abortFound = 0U;

      while (ecx_iserror(&soem_context))
      {
        if (!ecx_poperror(&soem_context, &err))
        {
          break;
        }
        if ((err.Etype == EC_ERR_TYPE_SDO_ERROR) &&
            ((err.Index == SOEM_POSITION_GAIN1_INDEX) ||
             (err.Index == SOEM_POSITION_GAIN2_INDEX)))
        {
          abortCode = err.AbortCode;
          abortFound = 1U;
          break;
        }
      }

      if (abortFound != 0U)
      {
        char line[112];
        (void)snprintf(line,
                       sizeof(line),
                       "SOEM: position gain apply failed abort=0x%08lX",
                       (unsigned long)((uint32_t)abortCode));
        soem_log(line);
      }
      else
      {
        soem_log("SOEM: position gain apply failed (0x2101/0x2105)");
      }
    }
  }

  if (soem_position_gain_read_pending != 0U)
  {
    int32_t gainVal = 0;
    uint8_t used16 = 0U;
    uint16 readIndex = 0U;
    int32_t abortCode = 0;
    uint8_t abortFound = 0U;

    int wkc = soem_try_read_position_gain(SOEM_POSITION_GAIN1_INDEX, &gainVal, &used16);
    if (wkc > 0)
    {
      readIndex = SOEM_POSITION_GAIN1_INDEX;
    }
    else
    {
      wkc = soem_try_read_position_gain(SOEM_POSITION_GAIN2_INDEX, &gainVal, &used16);
      if (wkc > 0)
      {
        readIndex = SOEM_POSITION_GAIN2_INDEX;
      }
    }

    if (wkc > 0)
    {
      soem_position_gain_readback = gainVal;
      soem_position_gain_read_updated = 1U;
      soem_position_gain = gainVal;
      soem_position_gain_read_pending = 0U;
      soem_position_gain_read_status = 20;

      char line[96];
      (void)snprintf(line,
                     sizeof(line),
                     "SOEM: position gain read ok idx=0x%04X %s",
                     (unsigned int)readIndex,
                     used16 ? "u16" : "u32");
      soem_log(line);
    }
    else
    {
      ec_errort err;

      while (ecx_iserror(&soem_context))
      {
        if (!ecx_poperror(&soem_context, &err))
        {
          break;
        }
        if ((err.Etype == EC_ERR_TYPE_SDO_ERROR) &&
            ((err.Index == SOEM_POSITION_GAIN1_INDEX) ||
             (err.Index == SOEM_POSITION_GAIN2_INDEX)))
        {
          abortCode = err.AbortCode;
          abortFound = 1U;
          break;
        }
      }
    }

    soem_position_gain_read_pending = 0U;
    if (wkc > 0)
    {
      /* success path already handled */
    }
    else if (abortFound != 0U)
    {
      if (((uint32_t)abortCode) == 0x06020000U)
      {
        soem_position_gain_read_status = -10;
        soem_log("SOEM: position gain unsupported (0x2101/0x2105)");
      }
      else
      {
        soem_position_gain_read_status = -31;
        char line[112];
        (void)snprintf(line,
                       sizeof(line),
                       "SOEM: position gain read failed abort=0x%08lX",
                       (unsigned long)((uint32_t)abortCode));
        soem_log(line);
      }
    }
    else
    {
      soem_position_gain_read_status = -30;
      soem_log("SOEM: position gain read failed (0x2101/0x2105)");
    }
  }

  if (soem_parameter_read_all_pending != 0U)
  {
    uint16_t acceleration = 0U;
    uint16_t deceleration = 0U;
    uint32_t feedConst = 1U;
    uint32_t shaftRevs = 1U;
    int32_t homeOffsetHw = 0;
    int32_t limitMinusUser = 0;
    int32_t limitPlusUser = 0;
    int32_t positionGain = 0;
    uint8_t positionGain16 = 0U;

    int okAcc = soem_read_uint16_object(0x2301, 0, &acceleration);
    int okDec = soem_read_uint16_object(0x2302, 0, &deceleration);
    int okFeed = soem_read_uint32_object(0x6092, 1, &feedConst);
    int okRevs = soem_read_uint32_object(0x6092, 2, &shaftRevs);
    int okHome = soem_read_int32_object(0x607C, 0, &homeOffsetHw);
    int okLimitMinus = soem_read_int32_object(0x607D, 1, &limitMinusUser);
    int okLimitPlus = soem_read_int32_object(0x607D, 2, &limitPlusUser);
    int okGain = soem_try_read_position_gain(SOEM_POSITION_GAIN1_INDEX, &positionGain, &positionGain16);
    if (okGain <= 0)
    {
      okGain = soem_try_read_position_gain(SOEM_POSITION_GAIN2_INDEX, &positionGain, &positionGain16);
    }

    soem_parameter_read_all_pending = 0U;

    if ((okAcc > 0) && (okDec > 0) && (okFeed > 0) && (okHome > 0) &&
        (okLimitMinus > 0) && (okLimitPlus > 0) && (okGain > 0))
    {
      int32_t unitScaleUser = (int32_t)feedConst;
      if ((okRevs > 0) && (shaftRevs > 0U))
      {
        unitScaleUser = (int32_t)(feedConst / shaftRevs);
      }
      if (unitScaleUser <= 0)
      {
        unitScaleUser = 1;
      }

      soem_parameter_read_all_values[0] = 0;
      soem_parameter_read_all_values[1] = (int32_t)acceleration;
      soem_parameter_read_all_values[2] = (int32_t)deceleration;
      soem_parameter_read_all_values[5] = unitScaleUser;
      soem_parameter_read_all_values[6] = homeOffsetHw / unitScaleUser;
      soem_parameter_read_all_values[3] = limitPlusUser;
      soem_parameter_read_all_values[4] = limitMinusUser;
      soem_parameter_read_all_values[7] = positionGain;
      soem_parameter_read_all_updated = 1U;
      soem_log("SOEM: parameter read-all ok");
    }
    else
    {
      soem_log("SOEM: parameter read-all failed");
    }
  }

