stardio/STM32_Ethercat_AGV/Appli/Core/Src/soem_port.c
}

static void soem_update_pdo_pointers(void)
{
  ec_groupt *grp = soem_context.grouplist + soem_group;
  char line[96];
  soem_rxpdo = NULL;
  soem_txpdo = NULL;
  soem_pdo_ready = 0U;

  if ((grp->outputs != NULL) && (grp->Obytes >= (int)sizeof(soem_rxpdo_t)))
  {
    soem_rxpdo = (soem_rxpdo_t *)grp->outputs;
  }

  if ((grp->inputs != NULL) && (grp->Ibytes >= (int)sizeof(soem_txpdo_t)))
  {
    soem_txpdo = (soem_txpdo_t *)grp->inputs;
  }

  if ((soem_rxpdo != NULL) && (soem_txpdo != NULL))
  {
    soem_pdo_ready = 1U;
    (void)snprintf(line, sizeof(line), "SOEM: PDO ready Obytes=%lu Ibytes=%lu",
             (unsigned long)grp->Obytes, (unsigned long)grp->Ibytes);
    soem_log(line);
    (void)snprintf(line, sizeof(line), "SOEM: IOmap=0x%08lX O=0x%08lX I=0x%08lX",
             (unsigned long)(uintptr_t)soem_iomap,
             (unsigned long)(uintptr_t)grp->outputs,
             (unsigned long)(uintptr_t)grp->inputs);
    soem_log(line);
    soem_log("SOEM: PDO ready");
  }
  else
  {
    (void)snprintf(line, sizeof(line), "SOEM: PDO mismatch Obytes=%lu Ibytes=%lu",
             (unsigned long)grp->Obytes, (unsigned long)grp->Ibytes);
    soem_log(line);
    (void)snprintf(line, sizeof(line), "SOEM: IOmap=0x%08lX O=0x%08lX I=0x%08lX",
             (unsigned long)(uintptr_t)soem_iomap,
             (unsigned long)(uintptr_t)grp->outputs,
             (unsigned long)(uintptr_t)grp->inputs);
    soem_log(line);
    soem_log("SOEM: PDO size mismatch");
  }
}

static void soem_cia402_step(uint16 statusword)
{
  uint16 effective_statusword = statusword;
  uint16 controlword = soem_last_controlword;

  soem_update_target_position_output();

  /* If PDO statusword is still zero, skip CiA402 processing —
   * the slave hasn't started sending TxPDO yet.  Do NOT use SDO
   * fallback here because SDO frames inside the cyclic PDO loop
   * corrupt the ETH DMA state and cause HardFault. */
  if (statusword == 0U)
  {
    static uint16 zero_count = 0U;
    zero_count++;
    if ((zero_count % 10U) == 1U)
    {
      soem_log("CIA402: waiting for PDO statusword");
    }
    /* Keep sending controlword=0 (no action) while waiting. */
    soem_rxpdo->controlword = 0U;
    soem_rxpdo->target_position = soem_target_position_output;
    return;
  }

  /* RUN/STOP direct gate:
   * RUN=0 -> hold at Shutdown command (0x0006), never auto-progress to Enable Op.
   * RUN=1 -> allow full CiA402 sequence to Operation Enabled.
   */
  if (soem_shadow_run_enable == 0U)
  {
    controlword = 0x0006U;
    soem_cia402_stage = SOEM_CIA402_STAGE_WAIT_READY;
    soem_cia402_hold_counter = 0U;
    soem_cia402_timeout_counter = SOEM_CIA402_TIMEOUT_CYCLES;

    if (controlword != soem_last_controlword)
    {
      char line[64];
      soem_last_controlword = controlword;
      (void)snprintf(line, sizeof(line), "CIA402: CW=0x%04X", controlword);
      soem_log(line);
    }

    soem_rxpdo->controlword = controlword;
    soem_rxpdo->target_position = soem_target_position_output;
    return;
  }

  /* Fault bit set: send fault reset first. */
  if ((effective_statusword & 0x0008U) != 0U)
  {
    if (soem_fault_active == 0U)
    {
      soem_fault_active = 1U;
      soem_log_fault_diagnostics(effective_statusword);
    }

    /* Before clearing the fault, align CSP target to the current actual position.
     * If RUN stays logically ON during recovery, a stale target can immediately
     * retrigger a following/position fault after Operation Enabled is restored. */
    soem_latch_target_to_actual("CIA402: fault recovery -> latch target to actual");

    controlword = 0x0080U;
    soem_cia402_stage = SOEM_CIA402_STAGE_SEND_SHUTDOWN;
    soem_cia402_hold_counter = 0U;
    soem_cia402_timeout_counter = 0U;
    soem_log("CIA402: Fault reset (0x0080)");
  }
  else
  {
    soem_fault_active = 0U;

    switch (soem_cia402_stage)
    {
      case SOEM_CIA402_STAGE_SEND_SHUTDOWN:
        controlword = 0x0006U;
        soem_cia402_hold_counter = SOEM_CIA402_HOLD_CYCLES;
        soem_cia402_timeout_counter = SOEM_CIA402_TIMEOUT_CYCLES;
        soem_cia402_stage = SOEM_CIA402_STAGE_WAIT_READY;
        soem_log("CIA402: Shutdown (0x0006)");
        break;

      case SOEM_CIA402_STAGE_WAIT_READY:
        controlword = 0x0006U;
        if (soem_cia402_hold_counter > 0U)
        {
          soem_cia402_hold_counter--;
          break;
        }

        /* Accept L7NH-ready variants: 0x21 or 0x31 (masked to 0x21). */
        if ((effective_statusword & 0x006FU) == 0x0021U)
        {
          soem_cia402_stage = SOEM_CIA402_STAGE_SEND_SWITCH_ON;
        }
        else if (soem_cia402_timeout_counter > 0U)
        {
          soem_cia402_timeout_counter--;
        }
        else
        {
          soem_log("CIA402: Timeout waiting ready, retry shutdown");
          soem_cia402_stage = SOEM_CIA402_STAGE_SEND_SHUTDOWN;
        }
        break;

      case SOEM_CIA402_STAGE_SEND_SWITCH_ON:
        controlword = 0x0007U;
        soem_cia402_hold_counter = SOEM_CIA402_HOLD_CYCLES;
        soem_cia402_timeout_counter = SOEM_CIA402_TIMEOUT_CYCLES;
        soem_cia402_stage = SOEM_CIA402_STAGE_WAIT_SWITCHED_ON;
        soem_log("CIA402: Switch On (0x0007)");
        break;

      case SOEM_CIA402_STAGE_WAIT_SWITCHED_ON:
        controlword = 0x0007U;
        if (soem_cia402_hold_counter > 0U)
        {
          soem_cia402_hold_counter--;
          break;
        }

        /* Accept L7NH-switched-on variants: 0x23 or 0x33 (masked to 0x23). */
        if ((effective_statusword & 0x006FU) == 0x0023U)
        {
          soem_cia402_stage = SOEM_CIA402_STAGE_SEND_ENABLE_OP;
        }
        else if (soem_cia402_timeout_counter > 0U)
        {
          soem_cia402_timeout_counter--;
        }
        else
        {
          soem_log("CIA402: Timeout waiting switched-on, retry switch-on");
          soem_cia402_stage = SOEM_CIA402_STAGE_SEND_SWITCH_ON;
        }
        break;

