stardio/STM32_Ethercat_AGV/Appli/Core/Src/soem_port.c
      case SOEM_CIA402_STAGE_SEND_ENABLE_OP:
        controlword = 0x000FU;
        soem_cia402_hold_counter = SOEM_CIA402_HOLD_CYCLES;
        soem_cia402_timeout_counter = SOEM_CIA402_TIMEOUT_CYCLES;
        soem_cia402_stage = SOEM_CIA402_STAGE_WAIT_OPERATION_ENABLED;
        soem_log("CIA402: Enable Op (0x000F)");
        break;

      case SOEM_CIA402_STAGE_WAIT_OPERATION_ENABLED:
        controlword = 0x000FU;
        if (soem_cia402_hold_counter > 0U)
        {
          soem_cia402_hold_counter--;
          break;
        }

        /* Accept L7NH-op-enabled variants: 0x27 or 0x37 (masked to 0x27). */
        if ((effective_statusword & 0x006FU) == 0x0027U)
        {
          soem_cia402_stage = SOEM_CIA402_STAGE_OPERATION_ENABLED;
          soem_log("CIA402: Operation enabled confirmed");
        }
        else if (soem_cia402_timeout_counter > 0U)
        {
          soem_cia402_timeout_counter--;
        }
        else
        {
          soem_log("CIA402: Timeout waiting op-enabled, retry enable-op");
          soem_cia402_stage = SOEM_CIA402_STAGE_SEND_ENABLE_OP;
        }
        break;

      case SOEM_CIA402_STAGE_OPERATION_ENABLED:
      default:
        controlword = 0x000FU;
        break;
    }
  }

  if (controlword != soem_last_controlword)
  {
    char line[64];
    soem_last_controlword = controlword;
    (void)snprintf(line, sizeof(line), "CIA402: CTL=0x%04X", controlword);
    soem_log(line);
  }

  soem_rxpdo->controlword = controlword;
  soem_rxpdo->target_position = soem_target_position_output;
}

void SOEM_PortSetLog(void (*log_fn)(const char *msg))
{
  soem_log_fn = log_fn;
}

void SOEM_PortInit(void)
{
  if (soem_initialized != 0U)
  {
    return;
  }
  if (ecx_init(&soem_context, SOEM_IFNAME) > 0)
  {
    soem_initialized = 1U;
    soem_log("SOEM: init ok");
  }
  else
  {
    soem_log("SOEM: init failed");
  }
}

void SOEM_PortPoll(void)
{
  if (soem_initialized == 0U)
  {
    return;
  }
  if (soem_configured == 0U)
  {
    static uint8 config_phase = 0;  /* 0=init, 1=wait_safeop, 2=wait_op */
    static uint16 phase_counter = 0;

    switch (config_phase)
    {
      case 0: /* --- INIT: config + request SAFE_OP --- */
      {
        char log_line[128];
        int slavecount = ecx_config_init(&soem_context);
        if (slavecount <= 0)
        {
          soem_log("SOEM: no slaves");
          return;
        }

        /* Force INIT → PRE_OP transition (SDO/mailbox requires PRE_OP) */
        soem_log("SOEM: forcing PRE_OP");
        soem_context.slavelist[0].state = EC_STATE_INIT;
        ecx_writestate(&soem_context, 0);
        for (volatile int d = 0; d < 1000000; d++) { }

        soem_context.slavelist[0].state = EC_STATE_PRE_OP;
        ecx_writestate(&soem_context, 0);

        /* Wait for PRE_OP (poll up to ~2 seconds) */
        {
          int preop_wait = 0;
          while (preop_wait < 20)
          {
            for (volatile int d = 0; d < 1000000; d++) { }
            ecx_statecheck(&soem_context, 0, EC_STATE_PRE_OP, 100000);
            ecx_readstate(&soem_context);
            uint16 st = soem_context.slavelist[1].state & 0x0FU;
            if (st >= EC_STATE_PRE_OP)
            {
              (void)snprintf(log_line, sizeof(log_line),
                             "SOEM: PRE_OP reached (try %d) state=0x%02X",
                             preop_wait, soem_context.slavelist[1].state);
              soem_log(log_line);
              break;
            }
            preop_wait++;
          }
          if (preop_wait >= 20)
          {
            (void)snprintf(log_line, sizeof(log_line),
                           "SOEM: PRE_OP timeout state=0x%02X",
                           soem_context.slavelist[1].state);
            soem_log(log_line);
            return;
          }
        }

        /* ACK any error state so slave is in clean PRE_OP */
        if ((soem_context.slavelist[1].state & 0x10U) != 0U)
        {
          soem_log("SOEM: Error ACK");
          soem_context.slavelist[0].state = (EC_STATE_PRE_OP | EC_STATE_ERROR);
          ecx_writestate(&soem_context, 0);
          for (volatile int d = 0; d < 1000000; d++) { }
          soem_context.slavelist[0].state = EC_STATE_PRE_OP;
          ecx_writestate(&soem_context, 0);
          for (volatile int d = 0; d < 500000; d++) { }
        }

        /* Manual PDO mapping BEFORE ec_config_map (matches working Linux code) */
        soem_log("SOEM: manual PDO mapping");
        if (soem_apply_manual_pdo_mapping(1) == 0)
        {
          soem_log("SOEM: manual PDO mapping FAILED");
          return;
        }

        /* Now let SOEM read the updated PDO assignments and configure SM */
        soem_log("SOEM: config_map_group");
        ecx_config_map_group(&soem_context, soem_iomap, soem_group);

        soem_update_pdo_pointers();

        /* Dump SOEM's SM configuration for slave 1 */
        {
          ec_slavet *sl = &soem_context.slavelist[1];
          (void)snprintf(log_line, sizeof(log_line),
                         "SM2: addr=0x%04X len=%u flags=0x%08lX",
                         sl->SM[2].StartAddr, sl->SM[2].SMlength,
                         (unsigned long)sl->SM[2].SMflags);
          soem_log(log_line);
          (void)snprintf(log_line, sizeof(log_line),
                         "SM3: addr=0x%04X len=%u flags=0x%08lX",
                         sl->SM[3].StartAddr, sl->SM[3].SMlength,
                         (unsigned long)sl->SM[3].SMflags);
          soem_log(log_line);
          (void)snprintf(log_line, sizeof(log_line),
                         "SOEM: Obits=%u Ibits=%u Obytes=%lu Ibytes=%lu",
                         sl->Obits, sl->Ibits,
                         (unsigned long)sl->Obytes, (unsigned long)sl->Ibytes);
          soem_log(log_line);
        }

        /* Set operation mode to CSP (Cyclic Synchronous Position) */
        {
          int8 mode = 8;
          (void)ecx_SDOwrite(&soem_context, 1, 0x6060, 0, FALSE, sizeof(mode),
                             &mode, EC_TIMEOUTRXM);
          soem_log("CIA402: Mode=CSP(8)");
        }

        soem_log("SOEM: requesting SAFE_OP");
        soem_context.slavelist[0].state = EC_STATE_SAFE_OP;
        ecx_writestate(&soem_context, 0);

