stardio/STM32_Ethercat_AGV/Appli/Core/Src/soem_port.c
        config_phase = 1;
        phase_counter = 0;
        return;
      }

      case 1: /* --- WAIT SAFE_OP (non-blocking, one check per poll) --- */
      {
        (void)ecx_send_processdata(&soem_context);
        (void)ecx_receive_processdata(&soem_context, EC_TIMEOUTRET);

        ecx_readstate(&soem_context);
        uint16 sl_state = soem_context.slavelist[1].state & 0x0FU;
        uint16 sl_al = soem_context.slavelist[1].ALstatuscode;
        phase_counter++;

        if (sl_state >= EC_STATE_SAFE_OP)
        {
          char msg[96];
          (void)snprintf(msg, sizeof(msg),
                         "SOEM: SAFE_OP reached (cycle %u) AL=0x%04X",
                         phase_counter, sl_al);
          soem_log(msg);

          /* PDO burst + OP request + wait in tight loop */
          soem_log("SOEM: PDO burst + OP transition");
          for (int burst = 0; burst < 200; burst++)
          {
            (void)ecx_send_processdata(&soem_context);
            (void)ecx_receive_processdata(&soem_context, EC_TIMEOUTRET);
            for (volatile int d = 0; d < 100000; d++) { } /* ~1ms delay */

            /* Request OP after first 50 bursts */
            if (burst == 50)
            {
              soem_log("SOEM: requesting OPERATIONAL");
              soem_context.slavelist[0].state = EC_STATE_OPERATIONAL;
              ecx_writestate(&soem_context, 0);
            }

            /* Check if OP reached */
            if (burst > 50 && (burst % 10) == 0)
            {
              ecx_readstate(&soem_context);
              if (soem_context.slavelist[1].state == EC_STATE_OPERATIONAL)
              {
                soem_configured = 1U;
                soem_log("[SOEM] OPERATIONAL reached in burst");
                break;
              }
            }
          }

          if (soem_configured == 0U)
          {
            /* Fall through to phase 2 polling */
            ecx_readstate(&soem_context);
            char m2[96];
            (void)snprintf(m2, sizeof(m2),
                           "SOEM: burst done state=0x%02X AL=0x%04X",
                           soem_context.slavelist[1].state,
                           soem_context.slavelist[1].ALstatuscode);
            soem_log(m2);
          }

          config_phase = 2;
          phase_counter = 0;
        }
        else if ((phase_counter % 10U) == 0U)
        {
          char msg[96];
          (void)snprintf(msg, sizeof(msg),
                         "SOEM: waiting SAFE_OP (%u) state=0x%02X AL=0x%04X",
                         phase_counter, soem_context.slavelist[1].state, sl_al);
          soem_log(msg);

          /* Re-request SAFE_OP periodically */
          soem_context.slavelist[0].state = EC_STATE_SAFE_OP;
          ecx_writestate(&soem_context, 0);
        }

        if (phase_counter > 100U)
        {
          soem_log("SOEM: SAFE_OP timeout — restarting config");
          config_phase = 0;
          phase_counter = 0;
        }
        return;
      }

      case 2: /* --- WAIT OPERATIONAL (non-blocking) --- */
      {
        (void)ecx_send_processdata(&soem_context);
        (void)ecx_receive_processdata(&soem_context, EC_TIMEOUTRET);

        ecx_readstate(&soem_context);
        uint16 sl_state = soem_context.slavelist[1].state;
        phase_counter++;

        if (sl_state == EC_STATE_OPERATIONAL)
        {
          soem_configured = 1U;
          soem_log("[SOEM] Slave reached OPERATIONAL state");
        }
        else if ((phase_counter % 10U) == 0U)
        {
          char msg[96];
          uint16 sl_al = soem_context.slavelist[1].ALstatuscode;
          (void)snprintf(msg, sizeof(msg),
                         "SOEM: waiting OP (%u) state=0x%02X AL=0x%04X",
                         phase_counter, sl_state, sl_al);
          soem_log(msg);

          soem_context.slavelist[0].state = EC_STATE_OPERATIONAL;
          ecx_writestate(&soem_context, 0);
        }

        if (phase_counter > 100U)
        {
          soem_log("SOEM: OP timeout — restarting config");
          config_phase = 0;
          phase_counter = 0;
        }
        return;
      }

      default:
        config_phase = 0;
        return;
    }
  }

  /* IOmap is in non-cacheable RAM_CMD (0x2406C000) — no cache clean needed.
   * The DMA reads directly from physical RAM for this region. */

  (void)ecx_send_processdata(&soem_context);
  {
    int wkc = ecx_receive_processdata(&soem_context, EC_TIMEOUTRET);
    static int last_wkc = -1;
    if (wkc != last_wkc)
    {
      char line[48];
      last_wkc = wkc;
      (void)snprintf(line, sizeof(line), "SOEM: wkc=%d", wkc);
      soem_log(line);
    }
  }

  if (soem_pdo_ready != 0U)
  {
  #if SOEM_ENABLE_PERIODIC_PDO_DEBUG
    static uint32 pdo_debug_counter = 0;
  #endif
    uint16 statusword = soem_txpdo->statusword;

    /* Update shadow copies for UI access */
    soem_shadow_position   = soem_txpdo->position_actual;
    soem_shadow_velocity   = soem_txpdo->velocity_actual;
    soem_shadow_torque     = soem_txpdo->torque_actual;
    soem_shadow_statusword = statusword;
    soem_shadow_pdo_ready  = 1U;
    if (statusword != soem_last_statusword)
    {
      char line[64];
      soem_last_statusword = statusword;
      (void)snprintf(line, sizeof(line), "CIA402: SW=0x%04X", statusword);
      soem_log(line);
      {
        uint8 state = soem_decode_cia402_state(statusword);
        if (state != soem_last_state)
        {
          soem_last_state = state;
          soem_log_cia402_state(state);
        }
      }
    }

#if SOEM_ENABLE_PERIODIC_PDO_DEBUG
    /* Debug: periodic statusword check every 5000 cycles (~5s) */
    pdo_debug_counter++;
    if ((pdo_debug_counter % 5000U) == 0U)
    {
      char line[128];
      ec_groupt *grp = soem_context.grouplist + soem_group;
      uint8 *inp = (uint8 *)grp->inputs;
      int ilen = (grp->Ibytes > 20) ? 20 : (int)grp->Ibytes;
      int pos = snprintf(line, sizeof(line), "IN[%d]:", ilen);
      for (int i = 0; i < ilen && pos < 120; i++)
      {
        pos += snprintf(line + pos, sizeof(line) - (size_t)pos, " %02X", inp[i]);
      }
      soem_log(line);
      (void)snprintf(line, sizeof(line), "PDO: SW=0x%04X CTL=0x%04X stg=%u cnt=%lu",
                     statusword, soem_rxpdo->controlword,
                     (unsigned)soem_cia402_stage, (unsigned long)pdo_debug_counter);
      soem_log(line);
    }
#endif

