stardio/STM32_Ethercat_AGV/Appli/Core/Src/soem_port.c
    soem_apply_pending_motion_settings();

    soem_cia402_step(statusword);
  }
}

/* ─── UI accessors (callable from TouchGFX task) ─────────────────────────── */

int32_t SOEM_GetPositionActual(void)  { return soem_hw_to_user((int32_t)soem_shadow_position); }
int32_t SOEM_GetPositionActualHw(void) { return (int32_t)soem_shadow_position; }
int32_t SOEM_GetVelocityActual(void)  { return (int32_t)soem_shadow_velocity; }
int16_t SOEM_GetTorqueActual(void)    { return (int16_t)soem_shadow_torque;   }
uint16_t SOEM_GetStatusword(void)     { return (uint16_t)soem_shadow_statusword; }
uint8_t  SOEM_GetPdoReady(void)       { return (uint8_t)soem_shadow_pdo_ready; }
uint8_t  SOEM_GetRunEnable(void)      { return (uint8_t)soem_shadow_run_enable; }

void SOEM_SetRunEnable(uint8_t enable)
{
  uint8_t requested = (enable != 0U) ? 1U : 0U;
  if (soem_shadow_run_enable != requested)
  {
    if ((soem_shadow_run_enable == 0U) && (requested != 0U))
    {
      /* Latch target to current actual position before enabling operation.
       * This prevents immediate following-error faults caused by stale target=0. */
      soem_latch_target_to_actual("CIA402: RUN ON -> latch target to actual");
    }

    soem_shadow_run_enable = requested;
    soem_log((requested != 0U) ? "CIA402: RUN request ON" : "CIA402: RUN request OFF");
  }
}

void SOEM_SetTargetPositionDelta(int32_t delta)
{
  int64_t nextUser = (int64_t)soem_hw_to_user(soem_target_position) + (int64_t)delta;
  if (nextUser > (int64_t)INT32_MAX)
  {
    nextUser = (int64_t)INT32_MAX;
  }
  else if (nextUser < (int64_t)INT32_MIN)
  {
    nextUser = (int64_t)INT32_MIN;
  }

  soem_target_position = soem_saturated_user_to_hw(soem_clamp_user_position((int32_t)nextUser));
  soem_target_position = soem_clamp_hw_position(soem_target_position);
}

void SOEM_SetTargetPositionAbs(int32_t pos)
{
#if SOEM_ENABLE_CMD_DEBUG_LOG
  char line[96];
#endif
  int32_t requestedUser = pos;
  soem_target_position = soem_saturated_user_to_hw(soem_clamp_user_position(pos));
  soem_target_position = soem_clamp_hw_position(soem_target_position);
#if SOEM_ENABLE_CMD_DEBUG_LOG
  (void)snprintf(line, sizeof(line), "CMD: set abs user=%ld hw=%ld out=%ld actual=%ld",
                 (long)requestedUser,
                 (long)soem_target_position,
                 (long)soem_target_position_output,
                 (long)soem_shadow_position);
  soem_log(line);
#else
  (void)requestedUser;
#endif
}

void SOEM_SetTargetPositionAbsHw(int32_t hwPos)
{
#if SOEM_ENABLE_CMD_DEBUG_LOG
  char line[96];
#endif
  soem_target_position = soem_clamp_hw_position(hwPos);
#if SOEM_ENABLE_CMD_DEBUG_LOG
  (void)snprintf(line, sizeof(line), "CMD: set abs hw=%ld out=%ld actual=%ld",
                 (long)soem_target_position,
                 (long)soem_target_position_output,
                 (long)soem_shadow_position);
  soem_log(line);
#endif
}

void SOEM_SetProfileVelocity(int32_t velocity)
{
  if (velocity < 0)
  {
    velocity = -velocity;
  }
  soem_profile_velocity = velocity;
  soem_profile_velocity_pending = 1U;
}

void SOEM_SetTorqueLimitPercent(uint16_t percent)
{
  if (percent > 100U)
  {
    percent = 100U;
  }
  soem_torque_limit_percent = percent;
  soem_torque_limit_pending = 1U;
}

void SOEM_SetProfileAcceleration(int32_t acceleration)
{
  if (acceleration < 0)
  {
    acceleration = -acceleration;
  }
  if (acceleration > (int32_t)SOEM_ACCDEC_MAX_MS)
  {
    acceleration = (int32_t)SOEM_ACCDEC_MAX_MS;
  }
  soem_profile_acceleration = acceleration;
  soem_profile_acceleration_pending = 1U;
}

void SOEM_SetProfileDeceleration(int32_t deceleration)
{
  if (deceleration < 0)
  {
    deceleration = -deceleration;
  }
  if (deceleration > (int32_t)SOEM_ACCDEC_MAX_MS)
  {
    deceleration = (int32_t)SOEM_ACCDEC_MAX_MS;
  }
  soem_profile_deceleration = deceleration;
  soem_profile_deceleration_pending = 1U;
}

void SOEM_SetSoftwareLimitPlus(int32_t limitPlus)
{
  if (limitPlus > SOEM_SW_LIMIT_ABS_MAX_UU)
  {
    limitPlus = SOEM_SW_LIMIT_ABS_MAX_UU;
  }
  else if (limitPlus < -SOEM_SW_LIMIT_ABS_MAX_UU)
  {
    limitPlus = -SOEM_SW_LIMIT_ABS_MAX_UU;
  }
  soem_limit_plus_user = limitPlus;
  soem_refresh_hw_limits();
  soem_software_limits_pending = 1U;
}

void SOEM_SetSoftwareLimitMinus(int32_t limitMinus)
{
  if (limitMinus > SOEM_SW_LIMIT_ABS_MAX_UU)
  {
    limitMinus = SOEM_SW_LIMIT_ABS_MAX_UU;
  }
  else if (limitMinus < -SOEM_SW_LIMIT_ABS_MAX_UU)
  {
    limitMinus = -SOEM_SW_LIMIT_ABS_MAX_UU;
  }
  soem_limit_minus_user = limitMinus;
  soem_refresh_hw_limits();
  soem_software_limits_pending = 1U;
}

void SOEM_SetUnitScale(int32_t scale)
{
  if (scale <= 0)
  {
    scale = 1;
  }
  soem_unit_scale = scale;
  soem_refresh_hw_limits();
  soem_unit_scale_pending = 1U;
}

void SOEM_SetPositionGain(int32_t gain)
{
  if (gain < 0)
  {
    gain = 0;
  }
  soem_position_gain = gain;
  soem_position_gain_pending = 1U;
}

void SOEM_RequestParameterReadAll(void)
{
  soem_parameter_read_all_pending = 1U;
  soem_parameter_read_all_updated = 0U;
}

uint8_t SOEM_FetchParameterReadAll(int32_t *valuesOut, uint8_t valueCount)
{
  uint8_t index;

  if ((valuesOut == NULL) || (valueCount < SOEM_PARAMETER_PAGE_VALUE_COUNT) ||
      (soem_parameter_read_all_updated == 0U))
  {
    return 0U;
  }

  for (index = 0U; index < SOEM_PARAMETER_PAGE_VALUE_COUNT; index++)
  {
    valuesOut[index] = soem_parameter_read_all_values[index];
  }

  soem_parameter_read_all_updated = 0U;
  return 1U;
}

void SOEM_RequestPositionGainRead(void)
{
  soem_position_gain_read_pending = 1U;
  soem_position_gain_read_status = 10;
}

uint8_t SOEM_FetchPositionGainRead(int32_t *gainOut)
{
  if ((gainOut == NULL) || (soem_position_gain_read_updated == 0U))
  {
    return 0U;
  }

  *gainOut = soem_position_gain_readback;
  soem_position_gain_read_updated = 0U;
  return 1U;
}

int32_t SOEM_GetPositionGainReadStatus(void)
{
  return soem_position_gain_read_status;
}

void SOEM_SetHomeOffset(int32_t offset)
{
  int32_t scale = (soem_unit_scale > 0) ? soem_unit_scale : 1;
  int64_t hwOffset = (int64_t)offset * (int64_t)scale;
  if (hwOffset > (int64_t)INT32_MAX)
  {
    hwOffset = (int64_t)INT32_MAX;
  }
  else if (hwOffset < (int64_t)INT32_MIN)
  {
    hwOffset = (int64_t)INT32_MIN;
  }

  soem_home_offset = (int32_t)hwOffset;
  soem_refresh_hw_limits();
  soem_home_offset_pending = 1U;
}

void SOEM_SetHomePosition(void)
{
  /* Define the current hardware position as the new origin (0).
   * After this call, GetPositionActual() returns 0 and all subsequent
   * SetTargetPositionAbs() calls are relative to this new origin. */
  soem_home_offset = soem_shadow_position;
  soem_refresh_hw_limits();
  soem_home_offset_pending = 1U;
  /* Also reset the motion target to 0 in hardware space = stay put. */
  soem_target_position = soem_clamp_hw_position((int32_t)soem_shadow_position);
  soem_log("HOME: origin set to current position");
}

#endif
